In [2]:
import pandas as pd

In [3]:
import numpy as np

In [64]:
data = np.random.rand(4,2)

In [65]:
data

array([[0.34559834, 0.00134518],
       [0.18117198, 0.48002287],
       [0.08012757, 0.58902156],
       [0.82294097, 0.02807874]])

In [66]:
#DataFrame two dimensional labeled

In [67]:
data_frame = pd.DataFrame(data)

In [68]:
data_frame

          0         1
0  0.345598  0.001345
1  0.181172  0.480023
2  0.080128  0.589022
3  0.822941  0.028079

In [69]:
new_df = pd.DataFrame(data, index = ["Sıroş","Sude","Tubiş","Talha"], columns = ["Age","Salary"])

In [70]:
new_df

            Age    Salary
Sıroş  0.345598  0.001345
Sude   0.181172  0.480023
Tubiş  0.080128  0.589022
Talha  0.822941  0.028079

In [71]:
new_df["Age"]

Sıroş    0.345598
Sude     0.181172
Tubiş    0.080128
Talha    0.822941
Name: Age, dtype: float64

In [72]:
new_df.loc["Tubiş"]

Age       0.080128
Salary    0.589022
Name: Tubiş, dtype: float64

In [73]:
new_df.iloc[0]

Age       0.345598
Salary    0.001345
Name: Sıroş, dtype: float64

In [74]:
new_df["Majority"] = 3

In [75]:
new_df

            Age    Salary  Majority
Sıroş  0.345598  0.001345         3
Sude   0.181172  0.480023         3
Tubiş  0.080128  0.589022         3
Talha  0.822941  0.028079         3

In [76]:
new_df.drop("Majority", axis = 1, inplace=True)

In [77]:
new_df

            Age    Salary
Sıroş  0.345598  0.001345
Sude   0.181172  0.480023
Tubiş  0.080128  0.589022
Talha  0.822941  0.028079

In [78]:
new_df.drop("Sude", inplace=True)
# axis belirtmeyince 0 olarak alıyor (row)

In [79]:
new_df

            Age    Salary
Sıroş  0.345598  0.001345
Tubiş  0.080128  0.589022
Talha  0.822941  0.028079

In [80]:
#data manipulation
new_df.loc["Talha","Age"] = 10

In [81]:
new_df

             Age    Salary
Sıroş   0.345598  0.001345
Tubiş   0.080128  0.589022
Talha  10.000000  0.028079

In [82]:
new_df.loc["Sıroş", "Salary"] = 65

In [83]:
new_df

             Age     Salary
Sıroş   0.345598  65.000000
Tubiş   0.080128   0.589022
Talha  10.000000   0.028079

In [85]:
new_df[new_df > 0]

             Age     Salary
Sıroş   0.345598  65.000000
Tubiş   0.080128   0.589022
Talha  10.000000   0.028079

In [88]:
new_df[new_df['Age'] > 0.2]

             Age     Salary
Sıroş   0.345598  65.000000
Talha  10.000000   0.028079

In [89]:
new_df

             Age     Salary
Sıroş   0.345598  65.000000
Tubiş   0.080128   0.589022
Talha  10.000000   0.028079

In [90]:
new_df = new_df.reset_index()

In [94]:
new_df

   index        Age     Salary
0  Sıroş   0.345598  65.000000
1  Tubiş   0.080128   0.589022
2  Talha  10.000000   0.028079

In [95]:
new_indices = ["Sır","Tub","Tal"]

In [96]:
new_df["Indices"] = new_indices

In [97]:
new_df

   index        Age     Salary Indices
0  Sıroş   0.345598  65.000000     Sır
1  Tubiş   0.080128   0.589022     Tub
2  Talha  10.000000   0.028079     Tal

In [98]:
new_df.set_index("Indices" , inplace=True)

In [99]:
new_df

         index        Age     Salary
Indices
Sır      Sıroş   0.345598  65.000000
Tub      Tubiş   0.080128   0.589022
Tal      Talha  10.000000   0.028079

In [100]:
# multi index

In [101]:
first_index = ["Simpson","Simpson","Simpson","SouthPark","SouthPark"]

In [102]:
innder_index = ["Bart","Homer","Cart","Mergment","Cyle"]

In [103]:
zipped_index = list(zip(first_index, innder_index))

In [104]:
zipped_index

[('Simpson', 'Bart'),
 ('Simpson', 'Homer'),
 ('Simpson', 'Cart'),
 ('SouthPark', 'Mergment'),
 ('SouthPark', 'Cyle')]

In [105]:
zipped_index = pd.MultiIndex.from_tuples(zipped_index)

In [106]:
zipped_index

MultiIndex([(  'Simpson',     'Bart'),
            (  'Simpson',    'Homer'),
            (  'Simpson',     'Cart'),
            ('SouthPark', 'Mergment'),
            ('SouthPark',     'Cyle')],
           )

In [109]:
sample_values = np.ones((5,2))

In [111]:
big_df = pd.DataFrame(sample_values, index = zipped_index, columns = ["Age","Salary"])

In [112]:
big_df

                    Age  Salary
Simpson   Bart      1.0     1.0
          Homer     1.0     1.0
          Cart      1.0     1.0
SouthPark Mergment  1.0     1.0
          Cyle      1.0     1.0

In [121]:
big_df.loc["Simpson"].loc["Cart"]

Age       1.0
Salary    1.0
Name: Cart, dtype: float64